content-org/o.org
:PROPERTIES:
:EXPORT_DATE: [2018-11-11 Mon 21:49]
:END:

* Snipes
:PROPERTIES:
:EXPORT_FILE_NAME: snipes
:EXPORT_HUGO_SECTION: docs/updates
:END:
I get nerdsniped by myself more often that i'd like, but i still want to keep the question in the back of my head. Other times I am just curious about things and to try it out myself even if the solution to the problem is known to the world. I'll dump my [[https://gwern.net/question][questions]] here.

** Systems
*** How would I really sort a big file?
Sort a 100GB file in 12GB memory. Various approaches.
#+begin_src shell
cat main.cpp | tr a-z A-Z
# vs
tr a-z A-Z < main.cpp
#+end_src
- What would =sort= do?
- [[https://en.wikipedia.org/wiki/External_sorting][External sorting - Wikipedia]]
- External sorting with concurrency
- [[https://news.ycombinator.com/item?id=34029603][Sorting with SIMD | Hacker News]]
- Loading it into a DB and sorting
- [[https://pythonspeed.com/articles/chunking-pandas/][Reducing Pandas memory usage #3: Reading in chunks]]
- [[https://pythonspeed.com/articles/indexing-pandas-sqlite/][Fast subsets of large datasets with Pandas and SQLite]]
- [[https://pythonspeed.com/articles/data-doesnt-fit-in-memory/][When your data doesn’t fit in memory: the basic techniques]]
- [[https://pandas.pydata.org/docs/user_guide/scale.html][Scaling to large datasets — pandas 2.0.0 documentation]]
- [[https://lobste.rs/s/3swdng/fitting_millions_documents_128_tb][Fitting millions of documents in 128 TB of virtual memory | Lobsters]] 🌟

*** Most efficient way to show last added file in the filesystem/dir
- [[https://stackoverflow.com/questions/1015678/get-most-recent-file-in-a-directory-on-linux][shell - Get most recent file in a directory on Linux - Stack Overflow]]
- [[https://stackoverflow.com/questions/4561895/how-to-recursively-find-the-latest-modified-file-in-a-directory][bash - How to recursively find the latest modified file in a directory? - Stack Overflow]]

*** Is IFS not Indian Forest Services? (Bash edition)
- This stuff is pretty basic but I don't think I totally get it plus there is some "shell" specific behavior that's weird.
- Also =man 1 read= (fish) and =man 1p read= (posix) are different, what about that idk. fish apparently does not document =-r= but still lets me use it.
- [[https://unix.stackexchange.com/questions/367982/are-files-opened-by-processes-loaded-into-ram][memory - Are files opened by processes loaded into RAM? - Unix & Linux Stack Exchange]]
- [[https://unix.stackexchange.com/questions/88487/what-happens-if-you-edit-a-script-during-execution][linux - What happens if you edit a script during execution? - Unix & Linux Stack Exchange]]
- [[https://unix.stackexchange.com/questions/209123/understanding-ifs-read-r-line][bash - Understanding "IFS= read -r line" - Unix & Linux Stack Exchange]]
- [[https://unix.stackexchange.com/questions/169716/why-is-using-a-shell-loop-to-process-text-considered-bad-practice][Why is using a shell loop to process text considered bad practice? - Unix & Linux Stack Exchange]]

*** How easy is for someone to steal my stdout stuff
- Example could be me logging my passwords in the cli.
- [[https://smallstep.com/blog/command-line-secrets/][How to Handle Secrets on the Command Line]]
*** Lower case letters?
- [[https://endtimes.dev/why-lowercase-letters-save-data/][why lowercase letters save data | endtimes.dev]]
** GPU
*** How does gpu actually do computation?
- Can experiment with this [[http://www.goldsborough.me/c++/python/cuda/2017/09/10/20-32-46-exploring_k-means_in_python,_c++_and_cuda/][blogpost]] also see [[https://github.com/someshkar/colabcat][someshkar/colabcat]]
- [[https://hadrieng2.github.io/code-that-counts/index.html][Introduction - Code that counts]]
- [[https://siboehm.com/articles/22/CUDA-MMM][How to Optimize a CUDA Matmul Kernel for cuBLAS-like Performance: a Worklog]]
** Security
*** Does iframe+cors does not do what i think it does?
See SO answers here [[https://www.google.com/search?q=signin+inside+iframe][signin inside iframe - Google Search]]
*** how would i hack myself w ssh?
- [[https://blog.thc.org/infecting-ssh-public-keys-with-backdoors][Infecting SSH Public Keys with backdoors]]
*** How to know everything about a website from the public domain(osint)
- google fu
- https://www.reddit.com/r/hacking/comments/vqczs/i_want_to_find_out_all_the_information_i_can/ (old but good starting point)
** Math
*** German Tank Problem
- [[https://news.ycombinator.com/item?id=38416912][> you can tell the growth rate of the company. You can even do this when]]
- [[https://en.wikipedia.org/wiki/German_tank_problem][German tank problem - Wikipedia]]
** Web
*** HTML title
- I noticed a long html title for [[https://equalitytime.github.io/FlowersForTuring/][Flowers for Turing]], makes me wonder what interesting things i can do by putting really long things into the title.
** Others
- [[https://news.ycombinator.com/item?id=38550737][Behind the scenes of Sound ID in Merlin]]
- [[https://news.ycombinator.com/item?id=38531428][How does Shazam work? (2022) | Hacker News]]
